docs/2012-11-27-RePrev.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>RePrev Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="RePrev Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="11/27/2012"/>
<meta name="author" content="Ken Williams"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">RePrev Notes</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Opening remarks</a>
<ul>
<li><a href="#sec-1-1">1.1 Dan, Dana, and Penny are out</a></li>
<li><a href="#sec-1-2">1.2 Rachel is also out</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Look back at concert</a>
<ul>
<li><a href="#sec-2-1">2.1 Feedback from David Mennicke</a></li>
<li><a href="#sec-2-2">2.2 Conversation about concert</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 Collaborator</a></li>
<li><a href="#sec-2-2-2">2.2.2 Literature</a></li>
<li><a href="#sec-2-2-3">2.2.3 Audience</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 Season</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Team reports</a></li>
<li><a href="#sec-4">4 February concert</a></li>
<li><a href="#sec-5">5 Listening</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Opening remarks</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Dan, Dana, and Penny are out</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Mike polled us to see who can be available for Cliff Digre's service
and/or remembrance on Friday 11/30.  We could potentially be available
for both, we'll ask the family what they'd like
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Rachel is also out</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Had surgery today.  Rachel is filling in as librarian.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Look back at concert</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Feedback from David Mennicke</h3>
<div class="outline-text-3" id="text-2-1">


<p>
Jan LeClair led us through David's written remarks.  In general he was
very enthusiastic about how things went.
</p>
<p>
His requests:
</p>
<ul>
<li>Continue to work on consistent attendance!
</li>
<li>Try to work on getting a full range of vocal colors
<ul>
<li>It's okay to not have a "signature sound"
</li>
</ul>

</li>
<li>A picture directory would be helpful
</li>
<li>Would also be nice to know people's backgrounds
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Conversation about concert</h3>
<div class="outline-text-3" id="text-2-2">


<p>
Started with review of names and favorite vacation spots.  Would be
helpful to have nametags during rehearsal actually - Sheri has some
tags to share.
</p>
<p>
Schele asked people to write down reactions to debriefing questions if
they don't get a chance to speak.
</p>

</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Collaborator</h4>
<div class="outline-text-4" id="text-2-2-1">


<p>
Monica, Jim, Joel, Becky are positive.  Appreciated his enthusiasm,
judgment on how ambitious to be, focus on vocal health.  Warmups were
very helpful to singing well.
</p>
<p>
Sheri mentions that this literature has an easier range to sing
healthily in, compared to some folk music we've done.
</p>
<p>
Sheldon appreciates his talented musicianship.  Brent appreciated his
preparedness.
</p>
</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Literature</h4>
<div class="outline-text-4" id="text-2-2-2">


<p>
Several people felt strongly that too much of the music was Christian
in focus.  Some didn't feel comfortable inviting people to this
concert.  Others thought the balance was fine.
</p>
<p>
There was much discussion on this.
</p>
</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Audience</h4>
<div class="outline-text-4" id="text-2-2-3">


<p>
Sheri: glad that we embrace families at our concerts.
</p>
<p>
Gerald: we should reach out to Latin communities nearby for our
upcoming concert.
</p>
<p>
Jan L: we have a couple of free concert venues for our next concert,
which is helpful.
</p>
<p>
Sheri: continue to use Facebook and give names for publicity.
</p>
<p>
Kathie: didn't get publicity email (Constant Contact), we'll have to
investigate why.
</p>

</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Season</h3>
<div class="outline-text-3" id="text-2-3">


<p>
Monica: could we do only 2 concerts per season?
</p>
<p>
Phil: could have really bad results on audience-building.
</p>
<p>
Schele: losing momentum could be bad for singer attrition.
</p>
<p>
Some feel concert week is very tiring - how can we help with that?
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Team reports</h2>
<div class="outline-text-2" id="text-3">


<ul>
<li>Mike: among singers, 36 singers, 38 absences.  11 people never missed any.
  Average 2 people missing per rehearsal.  Important to keep up good
  attendance habits.

</li>
<li>Sheri: financial report.  $1840 earned through Give To The Max
  campaign.  Grant for $2200 for next concert from Rimon Foundation,
  who funds Jewish arts in the community.

</li>
<li>Mike: ~300 people attended concerts.  $970 donated on Saturday, $278
  on Sunday.  $4.38 donated per person.  $5825 was spent on the
  concert, $2248 taken in donations.

</li>
<li>Mike: tickets?  In general, free concerts haven't made huge throngs
  come to the concerts.  May diminish people's impression of our
  value.  We have decided to try selling tickets for our next concert
  that would otherwise have been free.

</li>
<li>Schele: thanks riser crew, reception crew, venue crew.
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> February concert</h2>
<div class="outline-text-2" id="text-4">


<p>
Jan: little preview of next concert &amp; schedule.  We may try to drop
one of the dress rehearsals, or move it a week earlier, to combat
fatigue.
</p>
<p>
Jan: not sure whether we'll have a reception for the February
concerts.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Listening</h2>
<div class="outline-text-2" id="text-5">


<p>
Heard rough cuts of recording sessions from 2 weeks ago.
</p>
<ul>
<li>My Spirit Sang All Day
</li>
<li>Blow Ye the Trumpet
</li>
</ul>


<p>
Jan: please try to get here earlier next week so we can pass out music
before starting at 7:00.
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 11/27/2012</p>
<p class="author">Author: Ken Williams</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version N/A-fixup with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
