docs/2012-11-27-RePrev.tex
% Created 2012-12-06 Thu 21:47
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{RePrev Notes}
\author{Ken Williams}
\date{11/27/2012}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version N/A-fixup}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}

\section{Opening remarks}
\label{sec-1}
\subsection{Dan, Dana, and Penny are out}
\label{sec-1-1}


Mike polled us to see who can be available for Cliff Digre's service
and/or remembrance on Friday 11/30.  We could potentially be available
for both, we'll ask the family what they'd like
\subsection{Rachel is also out}
\label{sec-1-2}


Had surgery today.  Rachel is filling in as librarian.
\section{Look back at concert}
\label{sec-2}
\subsection{Feedback from David Mennicke}
\label{sec-2-1}


Jan LeClair led us through David's written remarks.  In general he was
very enthusiastic about how things went.

His requests:

\begin{itemize}
\item Continue to work on consistent attendance!
\item Try to work on getting a full range of vocal colors
\begin{itemize}
\item It's okay to not have a ``signature sound''
\end{itemize}
\item A picture directory would be helpful
\item Would also be nice to know people's backgrounds
\end{itemize}
\subsection{Conversation about concert}
\label{sec-2-2}


Started with review of names and favorite vacation spots.  Would be
helpful to have nametags during rehearsal actually - Sheri has some
tags to share.

Schele asked people to write down reactions to debriefing questions if
they don't get a chance to speak.
\subsubsection{Collaborator}
\label{sec-2-2-1}


Monica, Jim, Joel, Becky are positive.  Appreciated his enthusiasm,
judgment on how ambitious to be, focus on vocal health.  Warmups were
very helpful to singing well.

Sheri mentions that this literature has an easier range to sing
healthily in, compared to some folk music we've done.

Sheldon appreciates his talented musicianship.  Brent appreciated his
preparedness.
\subsubsection{Literature}
\label{sec-2-2-2}


Several people felt strongly that too much of the music was Christian
in focus.  Some didn't feel comfortable inviting people to this
concert.  Others thought the balance was fine.

There was much discussion on this.
\subsubsection{Audience}
\label{sec-2-2-3}


Sheri: glad that we embrace families at our concerts.

Gerald: we should reach out to Latin communities nearby for our
upcoming concert.

Jan L: we have a couple of free concert venues for our next concert,
which is helpful.

Sheri: continue to use Facebook and give names for publicity.

Kathie: didn't get publicity email (Constant Contact), we'll have to
investigate why.
\subsection{Season}
\label{sec-2-3}


Monica: could we do only 2 concerts per season?

Phil: could have really bad results on audience-building.

Schele: losing momentum could be bad for singer attrition.

Some feel concert week is very tiring - how can we help with that?
\section{Team reports}
\label{sec-3}


\begin{itemize}
\item Mike: among singers, 36 singers, 38 absences.  11 people never missed any.
  Average 2 people missing per rehearsal.  Important to keep up good
  attendance habits.
\item Sheri: financial report.  \$1840 earned through Give To The Max
  campaign.  Grant for \$2200 for next concert from Rimon Foundation,
  who funds Jewish arts in the community.
\item Mike: \~{}300 people attended concerts.  \$970 donated on Saturday, \$278
  on Sunday.  \$4.38 donated per person.  \$5825 was spent on the
  concert, \$2248 taken in donations.
\item Mike: tickets?  In general, free concerts haven't made huge throngs
  come to the concerts.  May diminish people's impression of our
  value.  We have decided to try selling tickets for our next concert
  that would otherwise have been free.
\item Schele: thanks riser crew, reception crew, venue crew.
\end{itemize}
\section{February concert}
\label{sec-4}


Jan: little preview of next concert \& schedule.  We may try to drop
one of the dress rehearsals, or move it a week earlier, to combat
fatigue.

Jan: not sure whether we'll have a reception for the February
concerts.
\section{Listening}
\label{sec-5}


Heard rough cuts of recording sessions from 2 weeks ago.

\begin{itemize}
\item My Spirit Sang All Day
\item Blow Ye the Trumpet
\end{itemize}

Jan: please try to get here earlier next week so we can pass out music
before starting at 7:00.

\end{document}
